test/fixtures/list_transactions.yml

---
http_interactions:
- request:
    method: get
    uri: https://imagerelay-staging.chargeover.com/api/v3/transaction?limit=100&offset=0
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - Faraday v0.9.1
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - ! '*/*'
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Wed, 25 Mar 2015 16:53:15 GMT
      Server:
      - Apache
      Transfer-Encoding:
      - chunked
      Content-Type:
      - application/json
    body:
      encoding: US-ASCII
      string: ! "{\n  \"code\":200,\n  \"status\":\"OK\",\n  \"message\":\"\",\n  \"response\":[\n
        \   {\n      \"transaction_id\":65,\n      \"gateway_id\":201,\n      \"currency_id\":1,\n
        \     \"token\":\"1mxjouz3irvp\",\n      \"transaction_date\":\"2015-03-20\",\n
        \     \"gateway_status\":1,\n      \"gateway_transid\":\"*TEST CC* Fri, 20
        Mar 2015 14:09:52 -0500\",\n      \"gateway_msg\":\"\",\n      \"amount\":99,\n
        \     \"fee\":-2.97,\n      \"transaction_type\":\"pay\",\n      \"transaction_method\":\"Visa\",\n
        \     \"transaction_detail\":\"x4242\",\n      \"transaction_datetime\":\"2015-03-20
        14:09:52\",\n      \"void_datetime\":null,\n      \"transaction_type_name\":\"Payment\",\n
        \     \"currency_symbol\":\"$\",\n      \"currency_iso4217\":\"USD\",\n      \"customer_id\":6\n
        \   },\n    {\n      \"transaction_id\":66,\n      \"gateway_id\":201,\n      \"currency_id\":1,\n
        \     \"token\":\"s3kmx5g6l8rp\",\n      \"transaction_date\":\"2015-03-20\",\n
        \     \"gateway_status\":1,\n      \"gateway_transid\":\"*TEST CC* Fri, 20
        Mar 2015 14:29:22 -0500\",\n      \"gateway_msg\":\"\",\n      \"amount\":99,\n
        \     \"fee\":-2.97,\n      \"transaction_type\":\"pay\",\n      \"transaction_method\":\"Visa\",\n
        \     \"transaction_detail\":\"x4242\",\n      \"transaction_datetime\":\"2015-03-20
        14:29:22\",\n      \"void_datetime\":null,\n      \"transaction_type_name\":\"Payment\",\n
        \     \"currency_symbol\":\"$\",\n      \"currency_iso4217\":\"USD\",\n      \"customer_id\":6\n
        \   },\n    {\n      \"transaction_id\":67,\n      \"gateway_id\":201,\n      \"currency_id\":1,\n
        \     \"token\":\"wenxbspvom9j\",\n      \"transaction_date\":\"2015-03-20\",\n
        \     \"gateway_status\":1,\n      \"gateway_transid\":\"*TEST CC* Fri, 20
        Mar 2015 14:52:58 -0500\",\n      \"gateway_msg\":\"\",\n      \"amount\":1188,\n
        \     \"fee\":-35.64,\n      \"transaction_type\":\"pay\",\n      \"transaction_method\":\"Visa\",\n
        \     \"transaction_detail\":\"x4242\",\n      \"transaction_datetime\":\"2015-03-20
        14:52:58\",\n      \"void_datetime\":null,\n      \"transaction_type_name\":\"Payment\",\n
        \     \"currency_symbol\":\"$\",\n      \"currency_iso4217\":\"USD\",\n      \"customer_id\":8\n
        \   },\n    {\n      \"transaction_id\":68,\n      \"gateway_id\":201,\n      \"currency_id\":1,\n
        \     \"token\":\"69cgbtyjaio5\",\n      \"transaction_date\":\"2015-03-20\",\n
        \     \"gateway_status\":1,\n      \"gateway_transid\":\"*TEST CC* Fri, 20
        Mar 2015 14:55:43 -0500\",\n      \"gateway_msg\":\"\",\n      \"amount\":99,\n
        \     \"fee\":-2.97,\n      \"transaction_type\":\"pay\",\n      \"transaction_method\":\"Visa\",\n
        \     \"transaction_detail\":\"x4242\",\n      \"transaction_datetime\":\"2015-03-20
        14:55:43\",\n      \"void_datetime\":null,\n      \"transaction_type_name\":\"Payment\",\n
        \     \"currency_symbol\":\"$\",\n      \"currency_iso4217\":\"USD\",\n      \"customer_id\":9\n
        \   },\n    {\n      \"transaction_id\":69,\n      \"gateway_id\":201,\n      \"currency_id\":1,\n
        \     \"token\":\"yhd7ztowf46s\",\n      \"transaction_date\":\"2015-03-23\",\n
        \     \"gateway_status\":1,\n      \"gateway_transid\":\"*TEST CC* Mon, 23
        Mar 2015 09:16:01 -0500\",\n      \"gateway_msg\":\"\",\n      \"amount\":99,\n
        \     \"fee\":-2.97,\n      \"transaction_type\":\"pay\",\n      \"transaction_method\":\"Visa\",\n
        \     \"transaction_detail\":\"x4242\",\n      \"transaction_datetime\":\"2015-03-23
        09:16:01\",\n      \"void_datetime\":null,\n      \"transaction_type_name\":\"Payment\",\n
        \     \"currency_symbol\":\"$\",\n      \"currency_iso4217\":\"USD\",\n      \"customer_id\":10\n
        \   },\n    {\n      \"transaction_id\":70,\n      \"gateway_id\":201,\n      \"currency_id\":1,\n
        \     \"token\":\"get0kucl36f4\",\n      \"transaction_date\":\"2015-03-23\",\n
        \     \"gateway_status\":1,\n      \"gateway_transid\":\"*TEST CC* Mon, 23
        Mar 2015 09:16:55 -0500\",\n      \"gateway_msg\":\"\",\n      \"amount\":1188,\n
        \     \"fee\":-35.64,\n      \"transaction_type\":\"pay\",\n      \"transaction_method\":\"Visa\",\n
        \     \"transaction_detail\":\"x4242\",\n      \"transaction_datetime\":\"2015-03-23
        09:16:55\",\n      \"void_datetime\":null,\n      \"transaction_type_name\":\"Payment\",\n
        \     \"currency_symbol\":\"$\",\n      \"currency_iso4217\":\"USD\",\n      \"customer_id\":11\n
        \   },\n    {\n      \"transaction_id\":71,\n      \"gateway_id\":201,\n      \"currency_id\":1,\n
        \     \"token\":\"1kvpdec0w6b3\",\n      \"transaction_date\":\"2015-03-23\",\n
        \     \"gateway_status\":1,\n      \"gateway_transid\":\"*TEST CC* Mon, 23
        Mar 2015 13:05:44 -0500\",\n      \"gateway_msg\":\"\",\n      \"amount\":99,\n
        \     \"fee\":-2.97,\n      \"transaction_type\":\"pay\",\n      \"transaction_method\":\"Visa\",\n
        \     \"transaction_detail\":\"x4242\",\n      \"transaction_datetime\":\"2015-03-23
        13:05:44\",\n      \"void_datetime\":null,\n      \"transaction_type_name\":\"Payment\",\n
        \     \"currency_symbol\":\"$\",\n      \"currency_iso4217\":\"USD\",\n      \"customer_id\":12\n
        \   },\n    {\n      \"transaction_id\":72,\n      \"gateway_id\":201,\n      \"currency_id\":1,\n
        \     \"token\":\"ejfvnoyq02d7\",\n      \"transaction_date\":\"2015-03-23\",\n
        \     \"gateway_status\":1,\n      \"gateway_transid\":\"*TEST CC* Mon, 23
        Mar 2015 13:14:36 -0500\",\n      \"gateway_msg\":\"\",\n      \"amount\":99,\n
        \     \"fee\":-2.97,\n      \"transaction_type\":\"pay\",\n      \"transaction_method\":\"Visa\",\n
        \     \"transaction_detail\":\"x4242\",\n      \"transaction_datetime\":\"2015-03-23
        13:14:36\",\n      \"void_datetime\":null,\n      \"transaction_type_name\":\"Payment\",\n
        \     \"currency_symbol\":\"$\",\n      \"currency_iso4217\":\"USD\",\n      \"customer_id\":13\n
        \   },\n    {\n      \"transaction_id\":73,\n      \"gateway_id\":201,\n      \"currency_id\":1,\n
        \     \"token\":\"clj5s8iyem40\",\n      \"transaction_date\":\"2015-03-23\",\n
        \     \"gateway_status\":1,\n      \"gateway_transid\":\"*TEST CC* Mon, 23
        Mar 2015 13:16:38 -0500\",\n      \"gateway_msg\":\"\",\n      \"amount\":99,\n
        \     \"fee\":-2.97,\n      \"transaction_type\":\"pay\",\n      \"transaction_method\":\"Visa\",\n
        \     \"transaction_detail\":\"x4242\",\n      \"transaction_datetime\":\"2015-03-23
        13:16:38\",\n      \"void_datetime\":null,\n      \"transaction_type_name\":\"Payment\",\n
        \     \"currency_symbol\":\"$\",\n      \"currency_iso4217\":\"USD\",\n      \"customer_id\":14\n
        \   },\n    {\n      \"transaction_id\":74,\n      \"gateway_id\":201,\n      \"currency_id\":1,\n
        \     \"token\":\"ybkl5wx9cqde\",\n      \"transaction_date\":\"2015-03-25\",\n
        \     \"gateway_status\":1,\n      \"gateway_transid\":\"*TEST CC* Wed, 25
        Mar 2015 08:25:11 -0500\",\n      \"gateway_msg\":\"\",\n      \"amount\":99,\n
        \     \"fee\":-2.97,\n      \"transaction_type\":\"pay\",\n      \"transaction_method\":\"Visa\",\n
        \     \"transaction_detail\":\"x4242\",\n      \"transaction_datetime\":\"2015-03-25
        08:25:11\",\n      \"void_datetime\":null,\n      \"transaction_type_name\":\"Payment\",\n
        \     \"currency_symbol\":\"$\",\n      \"currency_iso4217\":\"USD\",\n      \"customer_id\":18\n
        \   },\n    {\n      \"transaction_id\":75,\n      \"gateway_id\":201,\n      \"currency_id\":1,\n
        \     \"token\":\"65z8rce0dojf\",\n      \"transaction_date\":\"2015-03-25\",\n
        \     \"gateway_status\":1,\n      \"gateway_transid\":\"*TEST CC* Wed, 25
        Mar 2015 08:34:43 -0500\",\n      \"gateway_msg\":\"\",\n      \"amount\":99,\n
        \     \"fee\":-2.97,\n      \"transaction_type\":\"pay\",\n      \"transaction_method\":\"Visa\",\n
        \     \"transaction_detail\":\"x4242\",\n      \"transaction_datetime\":\"2015-03-25
        08:34:43\",\n      \"void_datetime\":null,\n      \"transaction_type_name\":\"Payment\",\n
        \     \"currency_symbol\":\"$\",\n      \"currency_iso4217\":\"USD\",\n      \"customer_id\":19\n
        \   },\n    {\n      \"transaction_id\":76,\n      \"gateway_id\":201,\n      \"currency_id\":1,\n
        \     \"token\":\"n8eci06sayhr\",\n      \"transaction_date\":\"2015-03-25\",\n
        \     \"gateway_status\":1,\n      \"gateway_transid\":\"*TEST CC* Wed, 25
        Mar 2015 08:45:55 -0500\",\n      \"gateway_msg\":\"\",\n      \"amount\":99,\n
        \     \"fee\":-2.97,\n      \"transaction_type\":\"pay\",\n      \"transaction_method\":\"Visa\",\n
        \     \"transaction_detail\":\"x4242\",\n      \"transaction_datetime\":\"2015-03-25
        08:45:55\",\n      \"void_datetime\":null,\n      \"transaction_type_name\":\"Payment\",\n
        \     \"currency_symbol\":\"$\",\n      \"currency_iso4217\":\"USD\",\n      \"customer_id\":20\n
        \   },\n    {\n      \"transaction_id\":77,\n      \"gateway_id\":201,\n      \"currency_id\":1,\n
        \     \"token\":\"1dzgl7u653f4\",\n      \"transaction_date\":\"2015-03-25\",\n
        \     \"gateway_status\":1,\n      \"gateway_transid\":\"*TEST CC* Wed, 25
        Mar 2015 08:51:15 -0500\",\n      \"gateway_msg\":\"\",\n      \"amount\":99,\n
        \     \"fee\":-2.97,\n      \"transaction_type\":\"pay\",\n      \"transaction_method\":\"Visa\",\n
        \     \"transaction_detail\":\"x4242\",\n      \"transaction_datetime\":\"2015-03-25
        08:51:15\",\n      \"void_datetime\":null,\n      \"transaction_type_name\":\"Payment\",\n
        \     \"currency_symbol\":\"$\",\n      \"currency_iso4217\":\"USD\",\n      \"customer_id\":21\n
        \   },\n    {\n      \"transaction_id\":78,\n      \"gateway_id\":201,\n      \"currency_id\":1,\n
        \     \"token\":\"7lmoufz08eik\",\n      \"transaction_date\":\"2015-03-25\",\n
        \     \"gateway_status\":1,\n      \"gateway_transid\":\"*TEST CC* Wed, 25
        Mar 2015 08:52:51 -0500\",\n      \"gateway_msg\":\"\",\n      \"amount\":99,\n
        \     \"fee\":-2.97,\n      \"transaction_type\":\"pay\",\n      \"transaction_method\":\"Visa\",\n
        \     \"transaction_detail\":\"x4242\",\n      \"transaction_datetime\":\"2015-03-25
        08:52:51\",\n      \"void_datetime\":null,\n      \"transaction_type_name\":\"Payment\",\n
        \     \"currency_symbol\":\"$\",\n      \"currency_iso4217\":\"USD\",\n      \"customer_id\":22\n
        \   },\n    {\n      \"transaction_id\":79,\n      \"gateway_id\":100,\n      \"currency_id\":1,\n
        \     \"token\":\"ne0f7m81lyp9\",\n      \"transaction_date\":\"2015-03-25\",\n
        \     \"gateway_status\":1,\n      \"gateway_transid\":\"Manual credit\",\n
        \     \"gateway_msg\":\"\",\n      \"amount\":10,\n      \"fee\":0,\n      \"transaction_type\":\"cre\",\n
        \     \"transaction_method\":\"Credit\",\n      \"transaction_detail\":null,\n
        \     \"transaction_datetime\":\"2015-03-25 11:26:39\",\n      \"void_datetime\":null,\n
        \     \"transaction_type_name\":\"Credit\",\n      \"currency_symbol\":\"$\",\n
        \     \"currency_iso4217\":\"USD\",\n      \"customer_id\":20\n    },\n    {\n
        \     \"transaction_id\":80,\n      \"gateway_id\":201,\n      \"currency_id\":1,\n
        \     \"token\":\"k82mwh7peuax\",\n      \"transaction_date\":\"2015-03-25\",\n
        \     \"gateway_status\":1,\n      \"gateway_transid\":\"*TEST CC* Wed, 25
        Mar 2015 11:35:01 -0500\",\n      \"gateway_msg\":\"\",\n      \"amount\":490,\n
        \     \"fee\":-14.7,\n      \"transaction_type\":\"pay\",\n      \"transaction_method\":\"Visa\",\n
        \     \"transaction_detail\":\"x4242\",\n      \"transaction_datetime\":\"2015-03-25
        11:35:01\",\n      \"void_datetime\":null,\n      \"transaction_type_name\":\"Payment\",\n
        \     \"currency_symbol\":\"$\",\n      \"currency_iso4217\":\"USD\",\n      \"customer_id\":20\n
        \   },\n    {\n      \"transaction_id\":81,\n      \"gateway_id\":100,\n      \"currency_id\":1,\n
        \     \"token\":\"n9a8wezpmcq7\",\n      \"transaction_date\":\"2015-03-25\",\n
        \     \"gateway_status\":1,\n      \"gateway_transid\":\"Manual credit\",\n
        \     \"gateway_msg\":\"\",\n      \"amount\":20,\n      \"fee\":0,\n      \"transaction_type\":\"cre\",\n
        \     \"transaction_method\":\"Credit\",\n      \"transaction_detail\":null,\n
        \     \"transaction_datetime\":\"2015-03-25 11:52:25\",\n      \"void_datetime\":null,\n
        \     \"transaction_type_name\":\"Credit\",\n      \"currency_symbol\":\"$\",\n
        \     \"currency_iso4217\":\"USD\",\n      \"customer_id\":19\n    }\n  ]\n}"
    http_version: 
  recorded_at: Wed, 25 Mar 2015 16:53:21 GMT
- request:
    method: get
    uri: https://imagerelay-staging.chargeover.com/api/v3/transaction?limit=100&offset=100
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - Faraday v0.9.1
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - ! '*/*'
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Wed, 25 Mar 2015 16:53:15 GMT
      Server:
      - Apache
      Content-Length:
      - '74'
      Content-Type:
      - application/json
    body:
      encoding: US-ASCII
      string: ! "{\n  \"code\":200,\n  \"status\":\"OK\",\n  \"message\":\"\",\n  \"response\":[\n
        \   \n  ]\n}"
    http_version: 
  recorded_at: Wed, 25 Mar 2015 16:53:22 GMT
recorded_with: VCR 2.9.3
